DELETE FROM vote_notes;
DELETE FROM user_roles;
DELETE FROM restaurants;
DELETE FROM address;
DELETE FROM users;
DELETE FROM dishes;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password) VALUES
  ('User', 'user@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin'),
  ('User2', 'user2@yandex.ru', 'password');

INSERT INTO user_roles (role, user_id)VALUES
  ('ROLE_USER', 100000),
  ('ROLE_ADMIN', 100001),
  ('ROLE_USER', 100001),
  ('ROLE_USER', 100002);

INSERT INTO address (city, street, building) VALUES
  ('СПб', 'Невский пр.', 17),
  ('СПб', 'Лиговский пр.', 11),
  ('СПб', 'Большая Коньшенная ул.', 43),
  ('СПб', 'Наб. Реки Фонтанки', 82);

INSERT INTO restaurants (name, address_id) VALUES
  ('Строганофф', 100003),
  ('Terrassa', 100004),
  ('Столовая', 100005),
  ('McDonalds', 100006);


INSERT INTO vote_notes (date, restaurant_id, user_id) VALUES
  ('2015-05-30', 100007, 100000),
  ('2015-05-30', 100008, 100001),
  ('2015-05-30', 100009, 100002),
  ('2015-05-31', 100010, 100000),
  ('2015-05-31', 100010, 100001),
  ('2015-05-31', 100007, 100002);


INSERT INTO dishes (name, price, restaurant_id, date) VALUES
  ('Борщ', 1.55, 100007, '2015-05-30'),
  ('Котлета', 1.10, 100007, '2015-05-30'),
  ('Оливье', 7.50, 100007, '2015-05-30'),
  ('Окрошка', 1.30, 100008, '2015-05-30'),
  ('Компот', 2.15, 100008, '2015-05-30'),
  ('Стейк', 10.55, 100008, '2015-05-30'),
  ('Омары', 1.20, 100009, '2015-05-30'),
  ('Мидии', 10.85, 100009, '2015-05-30'),
  ('Сосиска', 0.75, 100009, '2015-05-30'),
  ('Кортофельное пюре', 0.35, 100010, '2015-05-30'),
  ('Каша', 2.10, 100010, '2015-05-30'),
  ('Сэндвич', 10.50, 100010, '2015-05-30'),
  ('Шаверма', 1.55, 100007, '2015-05-31'),
  ('Бургер', 1.10, 100007, '2015-05-31'),
  ('Пицца', 7.50, 100007, '2015-05-31'),
  ('Щи', 1.30, 100008, '2015-05-31'),
  ('Солянка', 2.15, 100008, '2015-05-31'),
  ('Салат Цезарь', 10.55, 100008, '2015-05-31'),
  ('Салат из овощей', 1.20, 100009, '2015-05-31'),
  ('Капустка квашеная', 10.85, 100009, '2015-05-31'),
  ('Яичница', 0.75, 100009, '2015-05-31'),
  ('Голубцы', 0.35, 100010, '2015-05-31'),
  ('Перец фаршированный', 2.10, 100010, '2015-05-31'),
  ('Свинина по-французски', 10.50, 100010, '2015-05-31');